[{"filename": "Peng_Gu.pdf", "text": " Current address                       Peng Gu         Permanent address\n\n302 East John St.                              gupeng2015@gmail.com                  No.288 Caochangmen St.\nChampaign, IL, 61820\n       (217) 979-0814                             Nanjing, Jiangsu, China\n\n                                                                                  \n\nEDUCATION:\n \nUniversity of Illinois at Urbana-Champaign                   Expected Graduation: May 2019\n Bachelor of Engineering in Computer Engineering                      GPA:3.97\n Dean's List: Fall 2015(DGS), Spring 2016(DGS), Fall 2016(Engineering)\n Class Taken: CS 125(introduction to Computer Science), CS 225(Data structure and \n\nsoftware programming), CS 173(Discrete Structure) ECE 120(Introduction to Computing), \nECE 110(Introduction to Electronics)\n                                                                              \n\nEXPERIENCE:\n \nUniversity of Illinois Ikenberry Dinning Hall       \nStudent worker                    \n\nChampaign, IL\n\n                 Jan 2016 – May 2016\n\n Assisted chiefs to make wraps and sandwiches and improved communication skills by \n\nresponding to student inquires\n\n Checked the supplies in the supermarket to make sure sufficient supply\n Managed student workers about their duties and enhanced leadership skills\n\nNanjing Chengbei Waste Water Treatment Factory                \n Lab Assistant                              \n\n Nanjing, China\n\n                May 2014-August 2015\n\n Helped the workers to check if the machines work properly\n Collected and analyzed data for workers in the Chemistry lab to check quality of the water\n Assisted people in chemistry lab to fill in their experiment reports\n\nNanjing Dahua Cinema                                      \nVolunteer worker                           \n\nNanjing, China\n\n   June 2013-July 2015\n\n Coordinated the distribution and collection for 3-D glasses for watching movies\n Inspected in the cinema to avoid activities about copyright violation\n Directed people to go into correct room and checked their tickets\n\nLEADERSHIP & ACTIVITIES:\n \nSelf-Organized Book-donating Organization                   \nFounder                          \n\n                                                      \n\n Nanjing, China\nSeptember 2014\n\n Organized an activity that raised over 500 books for a primary school in Lianghe, China\n Communicated with Project Hope to find the school that is in need of books\n\nMillion Trees Project                                         \nPresident                              \n\nNanjing, China\n November 2012-June 2015\n\n Hosted various activities that encourage people in hometown to grow trees for the environment\n Conducted school activities on International Tree Planting Festival and managed the whole \n\nschool wide event of planting trees for an area\n\nSKILLS & PROJECTS:\n \nComputer Skills:\n\n                                                    \n\n Photoshop (intermediate), Microsoft Office (advanced), Java (advanced), C (fluent), C++ \n\n(fluent)\n\nClass Project:\n\n “Line avoider” Robotic Car that can drive itself between 2 white lines in ECE 110\n\n\f\f"}, {"filename": "Zecheng_Zhang .pdf", "text": "Zecheng Zhang\n\nDATA MINING · SCIENTIFIC COMPUTING\n\n303 S 5th ST, Apt 404, Champaign, IL, USA, 61820\n\n (+1) 217-979-3198 |  zzhan147@illinois.edu |  www.zechengzhang.com |  RagnaroWA |  zechengzhang\n\nEducation and certification\nUniversity of Illinois at Urbana-Champaign\nBachelor of Science in Computer Science, College of Engineering\nMajor: Computer Science\n• Honors: Edmund J. James Scholar and Dean’s List\nNanyang Technological University\nInternational Exchange Program\nRelated Course: Cyber Security\n\nMinor: Statistics\n\nAugust 2015 - May 2019\nUrbana-Champaign, IL\nGPA: 3.98 / 4.0\n\nSummer 2017\nJurong, Singapore\nGPA: 5.0 / 5.0\n\nResearch Experience\nUndergraduate Research Assistant, University of Illinois\nMarch 2017 - PRESENT\nLaboratory for Parallel Numerical Algorithms, Professor/Advisor: Edgar Solomonik\nUrbana-Champaign, IL\n• Developed Cyclops Tensor Framework (CTF) Python interface and part of C++ interface. Utilized CTF Python interface to implement graph\n\nconvolutional network. Wrote paper and experimented by using CTF Python for data analysis and graph convolutional network tasks\n\n• Helped the professor review a paper that about fast inference for convolutional neural network\n• Submitted a tutorial for Cyclops Tensor Framework Python interface and drafted a paper on data analysis by using the framework\n• Preparing undergraduate senior thesis on data analysis and computing topics\nUndergraduate Research Assistant, University of Illinois\nJanuary 2018 - PRESENT\nProfessor: Tarek Abdelzaher\nUrbana-Champaign, IL\n• Developed a Twitter fake account detection approach by using heterogeneous information network related methods and incorporating\n\nanalysis of features of Twitter fake account with a Ph.D. candidate\n\n• Leading on parts of projects which use graph convolutional networks and text CNN on GitHub and publication networks; the models\n\nrecommend papers to GitHub users or recommend GitHub repos to publication authors. Drafting the paper for submission in 2019\n\n• Mined graph and text data from GitHub and Twitter by using the GraphQL and Rest API. Cleaned data and constructed to usable dataset\n\nPublications\n• Huajie Shao, Shuochao Yao, Yiran Zhao, Zecheng Zhang, Lu Su, Zhibo Wang, Dongxin Liu, Shengzhong Liu and Tarek Abdelzaher. FADE:\nFake Account Detection Using Similarity-based Clustering in Social Networks. IEEE International Conference on Computer Communications\n(INFOCOM). [submitted]\n\n• Zecheng Zhang, Xiaoxiao Wu, Naijing Zhang, Siyuan Zhang, Edgar Solomonik. A Productive Framework for Parallel Tensor Data Analy-\n\nsis.[drafted]\n\nWork Experience\nServiceNow, Inc.\nMay 2018 - August 2018\nSoftware Engineer Intern at Research & Product Group\nSanta Clara, CA\n• Designed and built a conference-using product where users can post questions and poll lively. Administrator can manage the questions\n\nand polls on that platform lively\nImplemented natural language processing module for the platform to filter users’ similar questions and questions containing inappropri-\nate words in real-time. Used methods include GloVe and sentiment analysis\n\n• Developed and designed the front-end website and database models for the product. Front-end mainly implemented by using React.js\n\n•\n\nTeaching Experience\nCourse Assistant, University of Illinois\nMachine Learning (CS 446), Department of Computer Science\n• Graded students’ homework, which included machine learning problems (coding & written), average 5 hours per week\n• Proof read homework and exam (writing & coding) questions and answered students’ questions on Piazza\n• Managed and gave instructions for students’ deep learning cloud computing environment (Azure and Google Cloud)\n\nAugust 2018 - PRESENT\nUrbana-Champaign, IL\n\nZECHENG ZHANG\n\nRÉSUMÉ\n\n1\n\n\fCourse Assistant, University of Illinois\nIntro to Algs & Models of Comp (CS 374), Department of Computer Science\n• Graded students’ homework, which included algorithm problems (graph & Dynamic Programming etc.), average 6 hours per week\n• Helped teaching assistant teach on lab / discussion section (twice a week) and proctored midterm and final exams\n\nJanuary 2018 - May 2018\nUrbana-Champaign, IL\n\nProjects\nTwitter Project\nAugust 2018 - PRESENT\nPython, Pytorch, Javascript, Django\nUrbana-Champaign, IL\n• Working on a website to present a project for a Twitter surveillance system (deep learning model implemented in PyTorch) with a PhD\ncandidate. Users input their current twitter text data to the website and the back-end will run the trained deep learning model which will\nreturn the probability the user will be suspended by the Twitter\n\nData Mining Project\nJanuary 2018 - May 2018\nPython, Tensorflow\nUrbana-Champaign, IL\n• Group of three project on implementing a new pipeline for open domain event extraction. Given raw corpus, the pipeline will cluster\nsentences with similar event types together. Natural language processing techniques are used such as word sense disambiguation and\ncoreference resolution. Utilized graph convolutional network on embedding events by incorporating events relationships\n\n• Wrote a survey for the open domain event extraction and drafted a paper for the project pipeline. Gave presentation for each of the survey\n\nand drafted paper. The survey was selected as one of the best survey paper in UIUC CS 512 class in spring 2018\n\nWebsite Project\nJanuary 2018 - May 2018\nReact.js, Python, Express.js, Javascript, MySQL\nUrbana-Champaign, IL\n• Group of four project on creating a website to help UIUC CS students manage their CS classes based on their own computer science tracks\nand progress. Students also can record their own academic information, goals for semester, GPA and search UIUC CS classes with detailed\ncourse information displayed.\nImplemented advanced functions for the project: a simple bi-typed heterogeneous information network based ranking function for pro-\nfessors and classes. Frequent pattern mining on classes based on registration amount. Composing an overview report for the project.\n\n•\n\nText Mining Project\nJanuary 2017 - May 2017\nUrbana-Champaign, IL\nPython, HTML, CSS, Javascript\n• Crawled reviews of instructors from RateMyProfessor. Cleaned reviews, encoded the text information to vectors, trained and then sum-\n\nmarized the reviews into sentiment/emotion words which could represent the reviews\n\n• Crawled text data from Reddit/Subreddit and manually labeled those text; used machine learning models (svm) to learn whether classes\n\nor instructors more likely be positive or negative to students\n\n• Constructed a website which provided search functions for users to search instructors and classes and then displayed results generated\n\nby aforementioned models\nVirtual Reality Projects\nC#, Unity3D\n•\n• Developed an injection simulation project on Oculus VR. The implementation was created by using Unity3D. The functions of spread speed\nand drug concentration level were based on equations from several medical papers. Co-worked with a UIUC medical school instructor on\nthe project.\n\nImplemented a ﬂight Simulator game on Oculus VR by using Unity3D and quaternions. The plane can launch missiles and shoot targets\n\nJanuary 2017 - May 2017\nUrbana-Champaign, IL\n\nTechnical Skills\n\nProgramming languages: Python, Java, C++, C, JavaScript, Bash Script, Haskell, C#, R, CSS, HTML\nIoT MySQL, MongoDB, React.js, Express.js, Django, PHP\nPython packages: PyTorch, TensorFlow, Scipy, Numpy, Spark\nOther: Unity3D, WebGL, MIPS, Verilog, LATEX\nRelated Coursework & Interest\n\nData & Machine Learning: Data Mining, Machine Learning, Deep Learning, Artificial Intelligence, Text\nInformation Systems, Database Systems, Data Visualization\nAlgorithm & Numerical: Numerial Methods, Numerical Analysis, Algs & Models of Comp, Graph Theory in\nLinear Algebra, Tensor Algebra\nOther: Computer Architecture, System Programming, The Art of Web Programming, Progrmg Languages &\nCompilers, Virtual Reality, Interactive Computer Graphics\n\nZECHENG ZHANG\n\nRÉSUMÉ\n\n2\n\n\f"}, {"filename": "John_Doe.pdf", "text": "John Doe \n\nFull Address ▪ City, State, ZIP ▪ Phone Number ▪ E-mail \n\n \n\n \n\nOBJECTIVE: Design apparel print for an innovative retail company \n \n\nEDUCATION: \n \n\nUNIVERSITY OF MINNESOTA                                                                                                   City, State \nCollege of Design \n                                    May 2011 \n\n \n\n \n\n \n\n \n\n \n\n \n\n  Bachelor of Science in Graphic Design  \n  Cumulative GPA 3.93, Dean’s List \n  Twin cities Iron Range Scholarship \n\n \nWORK EXPERIENCE: \n \n \n \n\nAMERICAN EAGLE                                                                                                                       City, State \nSales Associate                                                                                                                    July 2009 - present \n\n \n \n \n\n \n\n \n\n  Collaborated with the store merchandiser creating displays to attract clientele \n  Use my trend awareness to assist customers in their shopping experience \n  Thoroughly scan every piece of merchandise for inventory control \n  Process shipment to increase my product knowledge \n\nPLANET BEACH                                                                                                                             City, State \nSpa Consultant                                                                                                                   Aug. 2008 - present \n\n  Sell retail and memberships to meet company sales goals \n  Build organizational skills by single handedly running all operating procedures \n  Communicate with clients to fulfill their wants and needs \n  Attend promotional events to market our services \n  Handle cash and deposits during opening and closing  \n  Received employee of the month award twice \n\n \nHEARTBREAKER                                    \nSales Associate   \n \n\n \n\n \n\n \n \n\n \n \n\n           \n \n\n \n \n\n                        City, State \n   May 2008 – Aug. 2008 \n\n  Stocked sales floor with fast fashion inventory \n  Marked down items allowing me to see unsuccessful merchandise in a retail market \n  Offered advice and assistance to each guest \n\nVICTORIA’S SECRET                                                                                                                    City, State \nFashion Representative                                                                                                  Jan. 2006 – Feb. 2009 \n\n  Applied my leadership skills by assisting in the training of coworkers \n  Set up mannequins and displays in order to entice future customers \n  Provided superior customer service by helping with consumer decisions \n  Took seasonal inventory \n\n \nVOLUNTEER EXPERIENCE: \n \n \n \n\nTARGET CORPORATION                                                                                                             City, State \nBrand Ambassador                                                                                                                        August 2009 \n\n  Represented Periscope Marketing and Target Inc. at a college event \n  Engaged University of Minnesota freshman in the Target brand experience \n\n\f"}, {"filename": "Yuxuan_Wang.pdf", "text": "Yuxuan Wang \n\nEDUCATION              \n\n217-979-0982 | ywang507@illinois.edu | 302 East John Street Apt 0709, Champaign, IL61820 \n\nThe University of Illinois at Urbana-Champaign, College of ACES                                                          Expected Graduation: May 2019 \nBachelor of science in Agriculture & Consumer Economics                                                                                                        GPA:3.81/4.00 \nConcentration: Financial Planning; Minor in Business                                                                                                                              \nHonors: Dean’s List (All Semester) \nCourses: Calculus, Statistical Methods, Python and R programming, Financial Modeling, Fundamental Finance, MySQL \n\nEXPERIENCE \n\n                                                                                  \n\n                                                       New York, NY                                                                            \n\nAlpha Capital Holdings, Inc.  \nSummer Investment Banking Analyst \n\n                                                                                        May. 2018- Aug. 2018 \n•  Completed a 3-statement operating model and researched supporting macro growth statistics for a jewelry company. Insights led to a \n\n \n\n \n\nbetter recommendation for the management and a higher acquisition target  \n\n•  Developed LBO models, DCF analysis, comparable trading with credit statistics and provided financing options and cost synergies  \n•  Negotiated documents for a leading cable delivery provider; built buy-side acquisition models and prepared client presentations out-\n\nlining options for $300M financing, consisting of Term Loan A & B, Senior Notes and Equity \n\n•  Led a group in stages of M&A accretion and dilution, merger analysis, due diligence by researching on a $2B healthcare service Co.’s \n\npurchase of its $500M peer to build entire acquisition model \n\n Jiangsu High Hope Wisdom Capital Co., Ltd \n Summer Financial Analyst \n\n \n\n \n\n \n\n \n\n  \n\n                                                     Nanjing, China \n\n                                                                                                                   May. 2017 - Aug. 2017 \n\n•  Created and managed a database of 20 portfolios, updating daily net asset value and growth value of each fund  \n•  Developed risk and return measures of portfolios by applying multiple statistical models   \n•  Completed performance attribution analysis on a weekly basis and projected future returns for portfolios   \n\nPROJECTS \nU.S Mutual Fund & Assets Allocation                                                                                                                                            Sep. 2018 – Nov. 2018             \n\n•  Analyzed return and risk profiles of US mutual funds and coded in Python to get several key risk statistics    \n•  Visualized and compared 3, 5,10-year performance of each fund, total return vs. S&P 500 and Gain/(Loss) total return vs. S&P 500; \n\nexplain the performance difference by visualizing the holdings of two mutual fund \n\n•  Used Python to employ Monte Carlo Simulation and optimized the portfolio of mutual funds using Sharpe Ratio as criteria  \n•  Evaluated the drivers of the past performance and developed financial models to make judgments on expected future performance \n\nEquity Choice Project                                                                                                                                                         Sep. 2017 – Oct. 2017            \n\n•  Conducted deep analysis on financial statements of Moody’s (MCO); identified the difficulties MCO will have to overcome and pos-\n\n• \n\nsible opportunities it might be able to seize over the next year or two \nInterpreted the regression results by comparing Beta coefficients and assessing the investment return of MCO’s stock in relation to \nthe stock’s systematic risk   \n\n•  Diversified the portfolio by adding the stock of Johnson & Johnson to reach the optimal combination of 30% MCO and 70% JNJ with \n\nminimum variance    \n\nStatistical Analysis for Effect of Population Density on PM2.5                                                                                    Oct. 2016- Nov. 2016                       \n\n•  Analyzed databases from the World Health Organization, identifying 4 key factors that positively correlated with air pollution rate \n•  Programmed multiple regression models to examine most significant determinants regarding PM2.5 and reduced the data set to create \n\na better and narrower model \n\nLEADERSHIP \nBusiness in Environmental Responsibility (Business Club)                                                                                                    Champaign, IL \nVice President                                                                                                                                                                         Sep. 2017-Present \n\n•  Led a team of 10 to work on a sustainability program and conducted a Solar Energy project in UIUC; recorded the number of panels, \n\ncollected data, compiled the data of output on each roof and tracked the energy used each year \n\n•  Assisted an officer from U.N in investigating the lead content of toys in countries of Asia to maintain business humanity  \n• \n\nInvited speakers from BP oil and Accenture for our education events; reached out to local companies for volunteer opportunities         \n\n                                                                                   Champaign, IL \nInternational Advertising Mob \nAccount Executive                                                                                                                                                                  Sep. 2015-Present \n•  Led a team of 15 to complete Planned “Burnham 310” project; create County Market campaign videos, increasing the brand aware-\n\n            \n\n \n\n \n\n \n\nness among women aged 18-30 in Champaign and Urbana; researched out up to 2,446 people with 1,114 engagement  \n\n•  Conducted research on the market situation, current marketing, and SWOT analysis to help increase brand popularity for both Inter-\n\nnational and Non-international students, resulting in 8% increase in sales revenue in a month \n\nTECHNICAL SKILLS \n\n•  Tools: Python, SQL, Excel, JavaScript, R, Morningstar, Bloomberg, Capital IQ \n•  Skills: Statistical Analysis, Financial Modeling, DCF Valuation, Comparable Analysis \n\n\f"}, {"filename": "Lanxin_Zhang.pdf", "text": "SummaryHighlightsCourse WorksEducationAccomplishmentsLanguagesExtra-Curricular ActivitiesVolunteer WorkLanxin Zhang412 Presby Hall, 405 East John StreetChampaign, IL 61820M: 2177219344lanxinz2@illinois.eduCurrent student working towards a bachelor degree in computer science, with excellentresearch, time management, and problem-solving skills.JavaExcellent problem-solving abilitiesFast learner    Excellent attention to detailOngoing: Intro to Computer Science (CS125); Freshman Honors  (CS 196)Upcoming: Software Design Studio (CS126); Discrete Structures (CS173)2019Urbana Champaign, Illinois, United StatesUniversity of Illinois at Urbana-ChampaignBachelor of Science: Computer ScienceGPA 4.02016Chongqing, Chongqing, ChinaChongqing Foreign Language SchoolHigh School DiplomaGPA 4.0; SAT 2340; SAT Subject Tests 2320Won first prize in a Micro-Film Competition in high School;Won Best Product Originality in Develop Summit for International Future Leaders;Fluent in Chinese and EnglishUnderstand French and CantoneseDecember 2013toCurrentChongqingNature Science ClubPresident Led club members conduct several experiments in the field of chemistry, physics, andbiology. Volunteered at Sri Lanka Sea Turtle Conservation\f"}, {"filename": "Peiwen_Jiang.pdf", "text": "Peiwen Jiang \n\nCurrent Address:                                        pj2@illinois.edu                                  Permanent Address:\n\n409 East Chalmers Street                            +1(217)-974-5902                                      Room 1504, No. 8, \n\nIllini Tower, Suite#308                                                                                          Lane 466, Tianbao Road \n\nChampaign, IL, 61820                                                                                                      Hongkou District \n\nShanghai, China, 200086\n\nEducation                                                                                                                                                             \n\nChatham Hall                                                                                                                    May, 2016 \n\nUniversity of Illinois at Urbana-Champaign                                                                  May, 2020 \n\nBachelor of Engineering \n\nExperience                                                                                                                                                     \n\nTongji University Civil Engineering Lab Intern                                                  Shanghai, China \n\n Calculated and simulated an automatic earthquake machine against catastrophe \n\n Tested the deformation of cable bridge used for nuclear power station \n\nChatham Hall STEM in Science                                                                                  Chatham, VA \n\nAugust, 2015 \n\nApril, 2014 \n\nApril, 2015 \n\n Held \"Celebrate STEM Day” as a member of STEM Team \n\n Solve engineering problems in TEAMS Competition, \"The Power of Engineering\" \n\n Promoted STEM activities to student bodies & campus faculty children \n\nUIUC Chinese Engineering Student Association                                              August,2016 – cont. \n\n Promote photos of events hold by association \n\nLeadership                                                                                                                                 \n\nLead Scout, Treasurer                                                                          September 2014 – May 2015 \n\nTutu Turtles Robotics Team (FTC5086) \n\n Co-designed the custom pieces and printed them on 3-D printer for our Robot \n\n Led new members to do scouting in competitions \n\n Made promotion of team in the judgement part of FTC competition about team’s financial   \n\nsupport and sponsors \n\nSocial Experience                                                                                                             \nSouth Africa Volunteer Trip                                                                                          March, 2014 \n\n Cleared land, cultivated gardens and renovated greenhouses in townships \n\n Undertook a range of repairs and prepared meals for local school & orphanage \n\nSkills and Awards                                                                                                               \n\n The Inspire Award, Shenandoah FIRST Tech Challenge, Championship Tournament (Semi-final) \n\n(2015) \n\n The Eastern Motivate Award, FTC State (VA) Qualifying Tournament (2015) \n\n Rank 1st, 2015 TSA TEAMS Competition (The Power of Engineering), VA Division 2 (2015) \n\n Chatham Hall Chapter of the National Honor Society Induction (2015) \n\n\f"}, {"filename": "Xiaochong_Zhang.pdf", "text": "Xiaochong (Skylar) Zhang \n\nxz9@illinois.edu | 217-778-6920 | 508 E University Ave, Apt 306, Champaign, IL, 61820 \n\n \n\nEDUCATION \nUniversity of Illinois, Urbana-Champaign \nExpected Graduation date: May 2020    \n \n\n \n \n\n \n \n\n \n \n\n \n \n\nBachelor of Science in Accounting \n\nBachelor of Science in Psychology   \n(Concentration in Industrial and Organizational Psychology) \n\n•  Dean’s list: Fall 2016, Spring 2017, Fall 2017 \n\n \n \n\n \n\n \n \n\n \n\nGPA: 3.89 \n \n(CPA Eligible) \n\n \n\n \n\n \nEXPERIENCE \nRuihua Certified Public Accountants   \nAudit Intern \n\n \n\n \n\n \n\n \n\n                \n \n \n\n \n\n        \n \n \n\n           Shanghai, China \n    May 2018-July 2018 \n\n• Draft the audit working papers, including Balance Sheet, Income Statement and \nInvoices, organize them in different volume files depending on years and firms \n• Participating in tasks as a group in doing internal control on Shanghai United Media   \n\n \n \n\nGroup \nIkenberry Dining Hall  \nStudent worker  \n      • Help prepare canteen food as well as manage the daily cleaning job \n      • Take orders in convenience store for fast food and the cashier \nMogu Education \n \nTeaching Assistant \n\n               \n         \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n\n      Champaign, IL \n            November 2016-March 2017 \n\n \n\n    Shanghai, China \n \n  May 2016-August 2016 \n\n• Help students to prepare SAT and TOEFL Exams \n \n\nACTIVITY \n \nConch Shell Mental Support  \nCore member in Department of Design and Publicity \n\n \n\n \n\n \n\n \n\n \n \n\n \n   \n\n \n\nChampaign, IL \n \n    May 2018, to Present \n\n• Help the RSO support the mental health of international students studying in US \n\n      • Edit the articles about mental health issues and publish on WeChat platform   \nTax research project with Virtual Reality  \nCore group member \n \n\nChampaign, IL \n  Spring 2019 \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n\n \n\n \n\n• Design the case analysis based on Al Capone’s crime   \n\n      • Analyze the tax code related to the tax evasion and use VR as the tool to present \n \nSKILLS \nLanguages: Chinese Mandarin (Proficient), English (Proficient) \nInstrument: Piano (Proficient) \nComputer: Adobe Photoshop (Functional); JAVA (Basic); HTML (Basic); R (Basic) \n\n\f"}, {"filename": "Xinyao_Wang.pdf", "text": "XINYAO WANG \n\nxinyaow2@illinois.edu | 217-607-6118 | 1010 W University Ave, Apt 348D, Urbana, IL, 61801 \n\nEDUCATION \n\n \n\n \n\nUniversity of Illinois at Urbana-Champaign \n\n \n\n \n\nBachelor of Science in Chemical and Biomolecular Engineering  \n\n \n\n \n\n \n\n \n\n       May 2020 \n\nGPA: 3.73/4.0 \n\n•  Dean’s list: Fall 2017, Spring 2018 \n\nEXPERIENCE \n\nShanghai BWIN English \n\nTeaching Assistant \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n•  Assist one student to prepare TOEFL Exam \n•  Deal with daily affairs \n\n \n\n         Shanghai, China \n \n           August 1st, 2018 to August 11th, 2018 \n\n \n\nJiangsu Feixiang Chemical Group of Companies  \n\nLab Assistant Intern \n\n \n\n \n\n \n\n \n\n \n\nSuzhou, China \n                     July 1st, 2018 to July 31st, 2018 \n\n \n\n \n\n•  Assist coworkers to synthesize organic compounds, including PEP salts \n•  Design the process and apply to synthesize an organic compound alone under the \n\nsupervision \n\n•  Organize the lab room and clean the experimental apparatus \n\nShanghai BWIN English \n\nTeaching Assistant \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n•  Assist 10 students to prepare SAT Exam \n•  Deal with daily affairs \n\nFAR University Housing \n\nDining Service \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n         Shanghai, China \n\n                        Summer, 2017 \n\n \n\n                  Urbana, IL \n\n               November, 2016 to February, 2017 \n\n•  Cooperate with other students to provide a decent dining experiences to customers \n•  Organize the kitchen and clean the dining area \n\nACITIVITY \n\n2015 World Table Tennis Championship   \n\nVolunteer \n\n•  Assist workers to order and guide viewers \n\nIVY Model United Nation    \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n  Suzhou, China, 2015 \n\n  Suzhou, China, 2015 \n\nVolunteer \n\n•  Assist to order and guide participants \n•  Record the meeting contents \n\nSKILLS \n\nLanguage: Mandarin (Fluent) \n\nComputer: Python (Basic), Matlab (Basic), Office 365 (Advanced) \n\n\f"}, {"filename": "Yuyang_Liu.pdf", "text": "Yuyang Liu  \n\n \n\nHome Address: Xinshiji Huayuan #77-501, Wuxi, China 21400 \n\nLocal Address:1010 W University Ave Apt 447A, Urbana, IL 61801 \n\n(217)979-5602 • yuyangl2@illinois.edu \n\nObjectives: \nTo obtain an internship with a software organization that will maximize my programming skills. \n \nEducation: \nUniversity of Illinois at Urbana-Champaign          \nBachelor of Science, Computer Science               \n\n \n \n\n \n \n\n \n \n\n \n \n\nDec 2019 \nGPA: 3.98/4.0 \n\n•  Dean’s List: Fall 2016, Spring 2017, Fall 2017 \n• \n•  Minor in Statistics \n\nJames Scholar Honor Program \n\nSkills: \n\n•  Proficient in Java, C++, Python, SQL, HTML, CSS, JavaScript \n•  Proficient in English and Chinese \n\n \nWork Experience: \nZhiYiHealth   \nFrontend Developer  \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n \n\n \n \n\n \n \n\n \n\n•  Worked with an IBM project team on the development of the Customer Relationship Management(CRM) \n\nsystem for the pharmaceutical company \n\n•  Researched and Understood the needs of the company’s management team \n•  Assisted in the mobile app development using Ionic Framework (HTML, SCSS, TS) \n•  Accomplished the features and functions designed by the interactive designer \n\n•  Assisted with meal preparation and service hot food to customers \n•  Took up different duties in dining hall such as Checker, Table Cleaner and provided a wonderful \n\nBeijing, China \nJune 2017 - July 2017 \n\nUrbana, Illinois \nJan 2017 - Jan 2018 \n\n \nUniversity Dining Service     \nStudent Worker  \n \n\n \n\n \n \n             \n\ndining experience for students \n\n \nActivities: \nDepartment of Computer Science \nCourse Assistant of CS125 \n\n \n\n \n \n\nUrbana, Illinois \nJan 2017 - Dec 2017 \n\nUrbana, Illinois \nSept 2017 - Present \n\n•  Organized and facilitated presentations and activities in lab sections \n•  Held office hours to clarify concepts and answer questions \n\n \nChinese Engineering Student Association   \nMember in Department of Development   \n \n\n•  Applies programming skills by developing the club’s official website  \n•  Assists in the maintenance of the club’s official mobile application ‘Uni-Corn’ \n•  Assists in the development of the WeChat mini-program ‘RideFinder’ \n\n \nProjects: \nGrabTheFood \n\n \n\n \n\n•  Developed an Android application with Android Studio which provides the food delivery service  \n•  Used Firebase Realtime Database to store user information, orders and restaurant menus \n• \n•  Used Picasso library for image downloading and caching  \n\nImplemented Google Sign-In authentication and photo-taking functionality \n\nMar 2017 - April 2017 \n\n \n\n\f"}, {"filename": "JACK_Li.pdf", "text": "508 E University Ave  Champaign, IL 61820 (719)-551-8999  gl8@illinois.edu \n\nJACK (Gengxiao) Li \n\nEDUCATION                                                                                                                                                                           \n\nUNIVERSITY OF ILLINOIS                                                                                                            Urbana-Champaign, IL \nMaster of Science in Financial Engineering, Expect Dec 2018 \nSYRACUSE UNIVERSITY                                                                                                                          Syracuse, NY \nBachelor of Computer Engineering, May 2017                                                        \nGPA: 3.59/4.0 \n\n \n\n \n\n \n\nWORKING EXPERIENCE                                                                                                                                                                             \n\nJ.P. Morgan Chase & Co.                                                                   \n\nIntern \n\n \n\n \n\n \n\n                                                                                                      Sep 2016-Oct 2016 \n\n● Walked through eight steps of how SAIC Motor successfully completed share placement \n\n● Summarized the bond and financing situation of EverGrande Group; mainly focus on analyzing corporate \n\nbonds and the affection to the company \n\n● Studied change of share ownership; compared the changes of share ownership of BBMG Group before \n\nand after trading \n\n● Getting to know the advantages and disadvantages of VIE structure; learned how companies relieved VIE \n\nstructure \n\nRESEARCH & ACTIVITIES                                                                                                                                                                   \nSenior Design: Blind Assist System \n\n                Jan2017-Apr 2017 \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n● Constructed a system to help blind person to walk on the side without working sticks \n\n● Main responsible for software programming; implemented algorithm to be able to find the edge of \n\nsidewalk from input images; then data to path analysis \n\n● Analyzed various types of images which included obstacle, traffic signal and crosswalk and the \n\nimproved recognition rate \n\n● Completed video stabilization and edge detection program, line detection program; Utilized Open VX \n\nframework setup and configured on Nvdia X1 \n\nVerification of Hardware Design of Spiking Neuron Network       \n\n \n\n \n\n \n\n \n\n \n\nMay 2016-July 2016 \n\nInstructor: Qinru Qiu     \n\n●Verified the spiking neuron model function and fixed bugs in a three-person student team \n\n● Studied how to go through data path and learned how to check waveform and modify the code to fix               \n\nbugs \n\n● Simulated the result of spiking neuron network by using MobaXterm and Cadence  Simulator through \n\nusing Verilog \n\n● Testing pipeline multiplier; Ran hardware neuron simulator successfully. \n\nSKILLS                                                                                                                                                                                           \n\nLanguage: Native Speaker of Mandarin, fluent in English \nTechnical: Proficient in Language C, C++, C#, System C, Java, Vhdl. \n\nOTHERS                                                                                                                                                     \n\nInterest: Basketball, workout, swimming, travelling.   \n\n\f"}, {"filename": "JIAHAO_HUANG.pdf", "text": "512 S Third St, Apt.210, Champaign, IL 61820•Tel: (217)904-9035•Email: jiahaoh3@illinois.edu \n\nJIAHAO HUANG \n\nEDUCATION \nUniversity of Illinois                                                                                                                    Urbana-Champaign, IL \nMaster of Science in Financial Engineering, 12/2018 \nSun Yat-sen University                                                                                                                        Guangzhou, China \nBS in Applied Mathematics with a Minor in Finance, 06/2017                                                              Major GPA:3.7/4 \n  Honor: Third-class Scholarship, from 2014 to 2016 \n  Relevant  Courses:  Mathematical  Analysis,  Linear  Algebra,  Differential  Equations,  Probability  Theory,  Data \nStructures  and  Algorithms,  Numerical  Analysis,  Real  Analysis,  Mathematical  Statistics,  Data  Mining,  Fixed \nIncome Securities, Investments, Financial Statements Analysis \n\nUniversity of California, Berkeley                                                                                                              Berkeley, CA \nSummer Session: Biostatistics, 08/2016                                                                                                            GPA:3.85/4 \n \nINTERNSHIP EXPERIENCE \nGF Securities Co., Ltd. \nData Analyst \n  Took charge of data analysis for two technology enterprises which are preparing for IPO \n  Utilized Python and R to fill missing values for over 100GB data of tens of millions of users, located users with \n\n                      Guangzhou, China \nNov.2016-Apr.2017 \n\n \n\nabnormal behaviors and plotted timed property sequence charts based on different circumstance \nSummarized first thousands of users' individual data by utilizing various packages and models such as pandas and \ndata.table to analyze their behaviors and check data validity \n\nAllied Victory Gold & Silver Investment Limited \nIntern Trader \n  Got familiar with various financial products(gold, forex, stocks, etc.), carried out simulated stock trading \n  Delivered macroeconomic analysis every day about global financial market based on economic indicators \n  Acted as a team leader to use Markowitz Model to build portfolio with Python \n \nACADEMIC RESEARCH \nQuantFactory Research Club \nTeam Research Member, a club formed by Central University of Finance and Economics \nMay.2017-Sep.2017 \n  Exploited  the  application  of  multiple-factor  analysis  to  the  selection  of  stocks  and  formation  of  investment \n\nHong Kong \nJan.2015-Feb.2015 \n\nportfolio \n\n  Researched  and  exercised  the  application  of  some  classification  models  and  cluster  models  of  machine \n\nlearning(Apriori, KNN, K-means, etc.) to forecast the trend of stocks \n\n  Read  up  classic  papers  about  financial  models(Fama-French  Three  Factors  Model,  Markowitz  Model,  CAPM \n\nPricing Model, Pair Trading) and realized them in Python \n\nThe Application of Monte Carlo Method into Option Pricing \nPrinciple Investigator, a Graduation Thesis, Advisor: Prof. Xiong Zou \n  Comprehended and capable of deducing several methods of option pricing models \n  Obtained historic  data  of  SH300  and  risk-free  rate  from  Python(Tushare  package),  Stimulated  standard  random \n\nMar.2017-May.2017 \n\ndigits, calculated the price of options with Monte Carlo method and compared the results with theoretical values \n\n  Understood the deduction of implied volatility and other variance reduction techniques to promote Monte Carlo \n\nMethod \n\nFinancial Modeling \nTeam Member, a Financial Engineering Paper, Advisor: Prof. Yan Zeng \n  Collected China stocks data from a python package Tushare \n  Conducted data attribution, data cleaning and data normalization, coded various indexes \n \n\nSelected strongly related factors through  correlation analysis, utilized BP neural network to classify and predict \nthe stocks \nImplemented and back tested the asset portfolio for stocks with a final return 6% higher than SH300 index \n\nOct.2015 \n\n \n \nSKILLS   \n  Language: Mandarin(Native), Cantonese(Native), English(Fluent) \n  Computer: C++, C, MATLAB, R, Python, SQL Server, STATA \n\n\f"}, {"filename": "JOSEPH_DEBROCK.pdf", "text": "512 E. Clark St, Apt 16 • Champaign, IL 61820 • (217) 649-7300 • jdebroc2@illinois.edu \n\nJOSEPH P DEBROCK \n\nEDUCATION___________________________________________________________________________ \n    \nUNIVERSITY OF ILLINOIS  \n   Urbana-Champaign, IL \nCandidate for Master of Science in Financial Engineering  \n                             December 2018  \n\n \n \n\n \n\n \n\n \n\n \n\nUNIVERSITY OF ILLINOIS           \n \nBachelor of Science, Engineering Physics  \n\n \n\n \n \n\n         \n \n\n                                Urbana-Champaign, IL  \n           August 2012 to May 2017 \n \n\n \n\n \n \n\nEXPERIENCE___________________________________________________________________________ \n                                                             Champaign, IL  \nLEGENDS BAR \nBartender, Security  \n \n                              May 2016 to May 2017  \n    \n   \n   \n \n\n• Maintained a safe and secure establishment of over 400 patrons and employees \n• Managed inventory of bar according to demand trends and depleted items \n• Provided outstanding service to guests with knowledge of specialty, imported, and domestic  \n   beers and liquors \n\n \n \n\n \n \n\n \n \n\nINDIAN ACRES SWIM CLUB  \nChild Care Associate \n   \n   \n   \n\n \n\n• Took responsibility for the daily care and wellbeing of over 50 children ages 6 to 12  \n• Led team of counselors in day-to-day activities and events \n• Assisted in the maintenance of the facility, grounds, and pool areas \n\n \n \n\n \n \n\n \n \n\n                                                             Champaign, IL  \n   \n                         June 2008 to August 2013 \n\nSKILLS________________________________________________________________________________ \n  \n\nProficient in C++ for implementing quantitative methods in finance \n\n  \n\nAdvanced applications of higher mathematics focusing on statistical and financial models \n\nACTIVITIES/LEADERSHIP_________________________________________________________________ \n                                                             Champaign, IL  \nTAP IN LEADERSHIP ACADEMY   \nTutor, Mentor    \n \n                         \n     December 2015 to May 2016 \n   \n   \n   \n\n• Established role-model relationships with high school and elementary school students \n• Educated aspiring students in mathematics, science, and biology \n• Created a positive environment that inspired students education through university level \n\n \n \n\n \n \n\n \n\nSIGMA ALPHA LAMBDA LEADERSHIP ORGANIZATION  \nActive Member  \n   \n   \n   \n\n• Engaged in efforts to serve community, including construction for elderly or unable locals \n• Aided in acquisition of supplies for local food pantries \n• Fundraised door to door to help Habitat for Humanity \n\n \n    \n\n \n                  Champaign, IL  \n     December 2013 to May 2016 \n\n                         \n\n \n\n \n\n \n\n \n\n \n\n \n\n\f"}, {"filename": "Jongnam_Kim.pdf", "text": "Jongnam Kim \n\n \n\n+1 (217) 417-0964 | jongnam.kim@gmail.com | 2079 Hazelwood Ct. APT C, Urbana, IL 61801 \n\nEDUCATION \nUniversity of Illinois at Urbana-Champaign \n      IL,  United  States \nMaster of Science in Financial Engineering                                                                August 2017 - Present \n• Relevant Coursework: Financial Economics, Financial Computing, Professional Development \n\n \nSeoul National University \n      Seoul,  South  Korea \nMaster of Science in Electrical Engineering and Computer Science                       March 2003 - Feb.2005 \n• Conducted studies on optimization of large data queries in the database laboratory \n• Thesis: Efficient Processing of Transitive Closure Queries in Ontology using Graph Labeling \n• Received academic excellence scholarship (Spring 2004/ Fall 2004) \n• Relevant Coursework: Database, Operating System, Distributed System, System software (XML)   \n\n \nSeoul National University \nBachelor of Science in Computer Science and Engineering \n• Received academic excellence scholarship (Fall 2000/ Spring 2001) \n• Relevant Coursework: Computer Programming, Automata Theory, Computer Networks \n \nSeoul National University \nBachelor of Science in Mathematics Education \n• Received academic excellence scholarship (Fall 1994/ Spring 1995/ Spring 1996/ Fall 1996) \n• Relevant Coursework: Calculus, Advanced Calculus, Geometry, Linear Algebra, Topology, Analysis \n\n      Seoul, South Korea \n      March 2000 - Feb.2003 \n\n      Seoul,  South  Korea \n      March 1993 - Feb.1997 \n\n \nPROFESSIONAL EXPERIENCE \nKorea Asset Management Corporation \n      South  Korea \nManager, Business Administration Management Group                                                  Feb.2014 - Present \n• Developed an enterprise budget plan of the company and operated it fiscally for two years \n• Worked as a cooperation manager with the National Assembly and the Korean government \n \nAssistant Manager, Financial Restructuring Support Group                                    March 2011 - Jan.2014 \n• Took over distressed-debt of savings banks to support financial restructuring   \n  • Conducted unlisted company stock valuations for buyout \n  • Redesigned the on-line public property bidding system through information strategy planning \n \nAssistant Manager, Business Administration Management Group                              Feb.2007 - Feb.2011 \n  • Developed the NPL (non-performing loan) management system for the company in 2008 \n  • Operated the NPL management system with accounting departments for four years   \n \nKorea Education & Research Information Service \n      South  Korea \nResearcher, Global Cooperation Center                                                                      June 2006 - Dec.2006 \n• Conducted studies on e-Learning Globalization to improve ICT use in Education   \n\n \nSKILLS AND OTHER INFORMATION \nCertification: Certified Financial Analyst Level 1 (June 2015) \nProgramming: Proficient in programming(C,C++,Java) and Python for quantitative analysis in finance \nMilitary: Served in the Republic of Korea Army as ROTC officer (March 1997 - June 1999) \n\n\f"}, {"filename": "LIJUN_HUANG.pdf", "text": " \n\n 402 South 5th Street, Champaign IL, 61820      Phone: (517)505-5954      Email: lhuang70@illinois.edu \n\nLIJUN HUANG \n\n \nEDUCATION   \nUniversity of Illinois at Urbana-Champaign \nMaster of Science in Financial Engineering \n\n \n\n \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n                    \n\n \n\n \n \n          Dec 2018 \n\n  Courses in progress: Financial Computing, Risk Modeling and Analysis, Statistical Methods in Finance \n  Research Assistant for Professor Dan Bernhardt (IBE Distinguished Professor at UIUC) \n  CFA Level I candidate \n\nUniversity of Illinois at Urbana-Champaign \nBachelor of Arts in Economics, Minor in Computer Science \n\n \n\n \n\n \n \n\n \n \n\n \n \n\n                  Aug 2015-May 2017 \n       Cumulative GPA: 3.86/4.00 \n\n  Coursework: Financial Economics, Business Statistics, Discrete Structures, Data Structures, Econometric \n  Dean’s List: Spring 2016 \n \n \n\nMichigan State University \nMajor in Economics \n\n                  Aug 2013-May 2015 \n       Cumulative GPA: 3.89/4.00 \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n  Coursework: Multivariable Calculus, Statistics for Business, Banking & Fin Markets, Financial Accounting \n  Dean’s List: Fall 2013, Spring 2014, Fall 2014, Spring 2015 \n\n \n\n \nEXPERIENCE                 \nSouthwest Security  \n \nSummer Quantitative Research Assistant  \n\n \n \n\n \n\n \n \n           \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n\n \n \n \n         Chongqing, China \n \n                  June 2015-Aug 2015 \n\n \n\n  Conducted research on effective indicators for predicting Chinese CSI300 stock index futures’ price movement \n  Performed back testing with historical data to evaluate trading strategies \n\nIndependent Stock and Commodity Trader \n\n \n\n \n\n \n\n \n\n \n\n \n\n           Jan 2014-Present \n\n  Analyzed companies’ financial situation and competitiveness based on their annual and market reports \n \n \n\nInterpreted government policy changes to make commodity option trading decisions \nIdentified emerging economic trends and their possible price impact on various stock sectors \n \n\n \n\nPROJECTS   \nData Mining Project \nPredicted movie ratings given by individual users \n\n \n \n                                                                                                                                    Champaign, IL \n                                             Spring 2017 \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n  Forecast movie ratings by developing a classification Python program used to analyze data \n  Processed one million training dataset, resulting in one-minute processing time \n\nEconometric Research Project  \nThe effect of joining E.U. on quality of life  \n\n \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n \n\n                            Champaign, IL \n                                Spring 2016 \n\n  Applied econometric method Difference in Difference (DID) for data analyzing \n  Collected data from various sources like The World Bank and U.N. data \n  Utilized R and Excel to process data and make final report \n\nACTIVITY AND LEADERSHIP EXPERIENCE \n \nEast Neighborhood International Student Association  \n \nBoard Member   \n\n \n\n \n\n \n\n \n\n \n \n \n\n \n \n \n\n \n\n \n \n \n                        East Lansing, MI \n \n                             Fall 2013-Spring 2015 \n\n \n\n \n\n  Planned events for weekly meetings and promoted effective group discussion  \n \n  Hosted campus events to increase communication among international students \n\nInstituted new plan to overhaul recruitment practices, resulting in 40% membership increase \n\n \n\n \n \nHONORS AND ACHIEVEMENTS \nMichigan State University Honors College member \n           Spring 2014-Spring 2015 \nThe Fifth Award in the Chinese CCTV “Star of Outlook” English Talent Competition (Chongqing, China)    Spring 2013 \n \nSKILLS \n\n \n \n\n \n \n\n \n \n\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n  Programming languages: Python, C++, JAVA \n  Other software: Visual Studio, Eclipse, Tableau, Bloomberg, R  \n  Languages: Mandarin (native), English (fluent) \n\n\f"}, {"filename": "LIWEN_JIANG.pdf", "text": "LIWEN JIANG \n\n+1(217)305-1617  1619 E Florida Ave, Urbana, IL  liwenj2@illinois.edu    \n\nhttps://www.linkedin.com/in/liwen-j-407419115/ \n\n \n\nEDUCATION \nUniversity of Illinois at Urbana-Champaign                                                                                      Sept 2017- Dec 2018 \nMaster of Science in Financial Engineering (Expected)                                                                       \nShanghai Jiao Tong University                                                                                                                                                                                                                           Sept 2013-Jun 2017                                                                                 \nMajor: Mathematics & Applied Mathematics (B.S)                                                                                      GPA: 3.65/4.0 \nSecond Major: International Economy & Trade                                                                                            GPA: 3.91/4.0 \n \nWORK EXPERIENCE \nStandard Chartered Bank                                                                                                                        Shanghai, China \nRisk Intern                                                                                                                                            Jul 2016-Dec 2016 \n  Reviewed 82 housing estates developers’ annual reports, evaluated them on detailed items such as revenue and \n\ndebt to equity. \n\n  Ranked 68 developers on the trust list of the bank mortgage department by their general performance to supply \n\nbase data for my manager to reduce credit risk in the future. \n\n  Presented preliminary analysis on credit risk data every month to help monitor the risk in time. \nAccenture Consulting                                                                                                                                Shanghai, China \nTechnology Consulting Intern                                                                                                                Jul 2015-Sept 2015 \n  Worked in a team of five to set the functional requirements for a project management software platform including \n\nspending profile, schedule tracking and contract requirements for our client company. \n\n  Found exactly related case studies and presented in both pictures and words to manager and consultants, which \n\nhelped the team to make our software requirements more detailed. \n\n \nMATHEMATICAL & COMPUTATIONAL EXPERIENCE \nGraduate Thesis for Mathematics & Applied Mathematics                                                              Mar 2017-Jun 2017 \nThe Laguerre Spectral Method to Solve the Numerical Solutions for Pricing Asian Option                                                                                     \n  Came up with a new algorithm to calculate the partial differential equations in Black Scholes Model for pricing \n\nAsian Option. \n\n  Coded and tested the algorithm in MATLAB with a convergent test function and have a very small deviation. \nGraduate Thesis for International Economy & Trade                                                                        Mar 2017-Jun 2017 \nThe Relationship between Studying Abroad and Trade Especially For China \n  Used linear regression on trading and studying abroad data in MATLAB to study the relationship between studying \n\nabroad and international trade. \n\n  Found that the number of the students going abroad to China for study has a very remarkable positive relationship \n\nwith China’s import trade volume from their home country. \n\nChina Undergraduate Mathematical Contest in Modeling: The Shadow of the Sun                                      Sept 2015 \n  Took the tech of non-linear fitting and made coding program in MATLAB to build a mathematical model to attain \n\ngeographic location on the shadow length data. \nIllustrated our model well in both thesis and oral presentation and finally got the National Second Prize (top 2%). \n\n \n \nEXTRACURRICULAR ACTIVITIES \nDirector, Outreach Department, International Cooperation Association in SJTU                            Nov 2013-Jul 2014 \n  Scheduled academic lectures for foreign professors and students \n  Designed cultural exchange activities under limited budget \n  Worked together with team members to minimized cost and maximize satisfaction of foreign visitors. \n \nCOMPUTIONAL SKILLS \n  Programing in C++, Python, MATLAB, VBA, SQL and R. \n  Certificated with Distinction on C++ Programming for Financial Engineering on quantnet.com. \n \nHonors & Awards \n  Mathematical Contest in Modeling, COMAP, Meritorious Award(top 9% global-wide)                              Apr 2017 \n  China Undergraduate Mathematical Contest in Modeling, National Second Prize(top 2% national-wide) Dec 2015                                                                                   \n \nRelated Courses \n  C Programming (A); VC++ Programming(A-); Thinking and Approach of Programming-Python(A-);   \n  Mathematical Stats(A); Stochastic Process(A-); Probability(A-); Quantitative Economics(A); \n\n\f"}, {"filename": "Qiyang_Li.pdf", "text": "Qiyang Li \n\nAddress: 302 East John Street, Champaign, IL, USA, 61820 \n\nEmail: qiyangl2@illinois.edu    Phone: (217)778-9983 \n\nEDUCATION \n\n \n\nUniversity of Illinois at Urbana-Champaign (UIUC) \n\nUrbana-Champaign, IL, USA \n\nMaster of Science, Financial Engineering \n\nShanghai University of Finance and Economics (SHUFE) \n\nBachelor of Economics, Statistics (Finance and Insurance Statistics) \n\n    Honors: \n\nAugust 2017 - present \n\nShanghai, China \n\nGPA: 3.44/4.0 \n\nSeptember 2012 - June 2016 \n\n▪ \n\n▪ \n\n2013 China Undergraduate Mathematical Contest in Modeling (CUMCM) \n\n-National Second Prize (November 2013)   \n\n-Provincial (Shanghai) First Prize (October 2013) \n\n2015-2016 Academic Year SHUFE People’s Scholarship, Third Rank \n\nWORKING EXPERIENCE \n\nSPD Silicon Valley Bank \n\nRisk Analyst, Risk Management Department \n\n \n\nShanghai, China \n\nJuly 2016 - July 2017 \n\n▪  Prepared and distributed loan portfolio analysis to senior management team and Risk Management Committee \n\n▪  Prepared regulatory reports on credit business to China Banking Regulatory Committee and People’s Bank of China   \n\n▪  Reported foreign exchange position and interbank placement monitoring data to EWRM manager \n\n▪  Assisted in IT projects related to risk management and regulatory reporting \n\nSPD Silicon Valley Bank \n\nIntern, Finance and Treasury Department \n\nShanghai, China \n\nMarch 2016 - June 2016 \n\n▪  Assisted in generating internal and external financial statements and reports, and maintained the daily financial data \n\n▪  Coordinated with Risk Management  Department and Corporate Banking Department to ensure the accuracy and \n\nvalidity of data \n\nDeutsche Bank China \n\nSummer Open House & Intern Program, Global Market Department \n\nShanghai, China \n\nAugust 2015 \n\n▪  Assisted in product distribution and tracked the overall sales performance of different kinds of product \n\n▪  Supported the statistical analysis on the sales volume of financial products such as foreign exchange and interest \n\nrate derivatives to evaluate market penetrability and performance \n\n▪  Helped  with  the  analysis  of  the  client  portfolio  to  suggest  more  profitable  and  customized  financial  solutions \n\ntogether with DB marketing team \n\nPrice Waterhouse Coopers (PWC) \n\nSummer Audit Intern Program \n\nShanghai and Kunming, China \n\nJuly 2015 \n\n▪  Assisted in the Pre-IPO auditing work of Kunming Dianchi Water Treatment Co. Ltd., located in Yunnan Province, \n\nin A share and H share market \n\nSKILLS \n\nLanguage: Native speaker of Chinese, fluent in English \n\nTechnical: Proficient in SPSS, Eviews, SAS and MS Office \n\nACTIVITIES & LEADERSHIP \n\n \n\n \n\n \n\n \n\nMember of SHUFE 26th Student Union, Information & Media Department \n\nSeptember 2012 - June 2013 \n\n▪  Outstanding Member of SHUFE 26th Student Union Award (May 2013) \n\nChief Director of SHUFE 27th Student Union, Information & Media Department \n\nSeptember 2013 - June 2014 \n\n \n\n\f"}, {"filename": "Renren_Deng.pdf", "text": "Renren(Kevin) Deng \n\n1615 E Florida Ave #302B, Urbana, IL, 61802. (216)767-6981. renrend2@illinois.edu \n\nEDUCATION                                                                                                                                                                               \n\nUniversity of Illinois at Urbana-Champaign                                                                                        Champaign, IL   \n\n  Major: M.S. in Financial Engineering                                                                                      08/2017 - 12/2018 \n\nCase Western Reserve University \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n                                          Cleveland, OH   \n\n  Double Majors: Mathematics & Finance; Minor: Economics                                                  08/2013 - 05/2017 \n\n \n\nCOMPUTER SKILL SETS                                                                                                                                                     \n\n  Programming: Java, C, C++, R, Matlab \n\n  Other: Excel Modeling, @Risk, Bloomberg Terminal \n\n \n\nPROFESSIONAL EXPERIENCE                                                                                                                                           \n\nAgricultural Bank of China Limited Credit Analysis Intern                                                              Guiyang, China \n\nCredit Analysis & Loan Risk Analysis                                                                         \n\n \n\n \n\n          5/2014 – 8/2014 \n\n  Assessed  borrowers’  credit  records  by  using  the  bank’s  credit  analysis  models,  organized  borrowers’ \n\nbackground information and wrote risk rating analysis reports   \n\n  Examined borrowers’ collaterals and sources of repayments using debt service coverage ratio \n\n  Analyzed  borrowers’  default  rates  and  built  financial  models  in  Excel  to  estimate  companies’  liquidation \n\nvalues by using NPV, CAPM, WACC, DCF, and multiples valuation methods \n\n \n\nTRADING EXPERIENCE                                                                                                                                                     \n\nFour Years of Trading Experience \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n        08/2013 – Present \n\n  Actively traded U.S. Stocks and ETFs over 4 years \n\n  Earned around 260% returns of the initial investments   \n\n  Proficiently applied fundamental and technical analyses building on the news of macro and micro markets \n\n \n\nASSOCIATION & LEADERSHIP                          \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n               \n\nCWRUCAPITAL Investment Club                                                                                                        Cleveland, OH \n\n  Analyzed listed companies through applying fundamental and technical analyses                08/2015-05/2016 \n\n  Presented analysis reports on weekly meeting \n\n  Participated in managing portfolios and setting investment strategies \n\nUIBE Campus Representative                                                                                                                Cleveland, OH \n\nSummer School Representative of University of International Business and Economics                        8/2015 – 5/2016 \n\n  Managed a group of 7 individuals to effectively promote Summer School’s reputation and popularity \n\n  Established connection and cooperation with organizations, relevant school departments, and individuals \n\n  Assisted university students who have questions about summer school \n\n \n\nRELATED PROJECTS \n\nProgramming Projects   \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n         \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n                         \n\n    Cleveland, OH \n\n \n\nIndependently  built  a  playable  Reversi  Game,  the  most  interesting  project  of  my  Java  course,  and  wrote  a \n\ngame tester by using Java, and earned the grade of 95%. \n\nFinance & Investment Projects \n\n  Analyzed factors that could influence companies’ stock performances by using Excel to perform regression \n\nanalysis, correlation analysis, and covariance analysis \n\n  Evaluated companies’ present values using CAPM, WACC, DCF, NPV, and multiples valuation methods, \n\nand estimated return rates of projects/investments by using CAPM, WACC, IRR, and NPV methods \n\n  Built Pro Forma financial statement in sale-driven models by using debt plugs and stock plugs   \n\n\f"}, {"filename": "Shuyang_Li.pdf", "text": "707 S Sixth St. Apt.411  ··  Champaign, IL 61820  ·  (217)-898-3919  ·  shuyang5@illinois.edu \n\nShuyang (Sophie) Li \n\nEDUCATION                                                                                                                                                                                                   \nUniversity of Illinois at Urbana-Champaign                                                                                                Champaign, IL \nMaster of Science in Financial Engineering                                                                                            August 2017-Present \nRelevant Coursework: Financial Computing, Financial Economics, Statistical Methods in Finance, etc. \n\n \n\n \n\nCentral University of Finance and Economics                 \nBachelor of Economics, Major in Investment                                                                                September 2013-June 2017 \nGPA: 3.79/4.0 (WES)    Highest Rank: 2/51 \nAwards: Meritorious Winner in COMAP Mathematical Contest in Modeling, Advanced Academic Performance (1%), \nFirst Class Scholarship (1/51), Merit Student (5/188), Outstanding Graduate   \nRelevant Coursework: Options and Futures, Corporate Finance, Operations Research, Stochastic Analysis, Econometrics \n \nINTERNSHIP & VOLUNTEERING EXPERIENCE                                                                                                                                                   \nChina International Capital Corporation, Ltd. (CICC)                                 \n\n                    Beijing, China \n\n                 \n\n             \n\n     \n\n \n\n                          Beijing, China                                                       \n\nIntern, Equities Department                         \n                                  September 2016-December 2016 \n  Participated in a $3M deal to design stock reduction plans for a client , assisted non-linear option pricing in Excel \n  Analyze the market dynamics, estimated future rate of returns on securities portfolio for strategy report \n  Prepared for 2016 CICC Investment Forum with over 200 listed company, coordinated meeting schedules with \n\n \n\n \n\n \n\n300 investors \n\nErnst & Young                                       \n\n            Beijing, China \nIntern, Assurance and Advisory Business Department                                                        January 2016-February 2016 \n  Gathered and analyzed data from 64 bank accounts, confirmed the balance adjustment items with banks, \n\n   \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\ncollaborated with colleagues for 2 annual auditing reports of Japanese Fortune 500 companies \n\n  Worked onsite at client premises, and performed due diligence for multinational corporations’ auditing projects \n\n \n\n \n\n \n\nAIESEC Global Citizen Program \n\n \n                                 \n\n                                                Marrakesh, Morocco \nVolunteer, Team Leader  \n                                                    August 2015 \n \n  Interviewed the Chinese Ambassador in Morocco, promoted local tourism via tourism magazine and social media \n  Hosted 6 lectures with over 100 audiences, invited management staff from Huawei Technologies Co. (Morocco)   \n                              Hanzhong, China \n \n\nIntern, Private Banking Department                                                             \n  Revised multiple reports for distribution to clients, including macroeconomic outlook, stock market review, advice \n\nIndustrial and Commercial Bank of China (ICBC)   \n \n\n     \n \n\n     \n \n\n \n \n\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n    January 2014-February 2014             \n\non financial management and asset allocation strategies \n\n \nACADEMIC RESEARCH EXPERIENCE                                                                                                                                                   \nPricing of Beijing Subway Based on Hoteling Model (MATLAB) Project Leader                                April 2014-Present \n\n  Conducted a theoretical economic research, built a subway pricing model with congestion and network effect \n  Led a team of 5 students and received a national fund for Undergraduate Innovation Training Program of $2,000 \n\nOption Pricing with MC Simulation and Finite Difference Methods (MATLAB, Excel)                  April 2016-May2016 \n  Applied MC Simulation and solved PDE of Black-Scholes model with Finite Difference Methods to price options, \n\nanalyzed the results of Finite Difference Methods of three schemes \n\n  Adopted two Variance Reduction techniques in Monte Carlo Simulation and compared the result of Sobol \n\nsequence with antithetic variable technique \n\nEvaluation of Sustainability COMAP, Mathematical Contest in Modeling (MATLAB, Excel)                      February 2015 \n\n  Built Fuzzy Analytic Hierarchy Process Model to rate sustainability of 121 countries   \n  Adopted modified Cobb-Douglas production function in measuring bio-capacity to build a prediction model   \n  Conducted scenario analysis and stress test to check the robustness of our model \n\nHouse Re-purchasing Demand Analysis Based on Logistic Regression Model (MATLAB, SPSS)              October 2014 \n\n  Analyzed 2000 surveys, statistically sorted the data in MATLAB \n  Developed the logistic regression model to analyze factors affecting house re-purchasing demand   \n\n \nSKILLS &HOBBIES                                                                                                                                                                                       \nComputer skills: MATLAB, C/C++, SQL, SPSS, Stata, Bloomberg terminals, WIND, Microsoft Office \nLanguages: Chinese (Native), English (TOEFL: 108/120; GRE: 326/340 AW 4.0/6) \nHobbies: Yoga, Swimming, Basketball (Small forward in school team), Piano (Level-8) \n\n\f"}, {"filename": "TENGRU_LI.pdf", "text": "707 S. Sixth St, Apt. 411      •      Champaign, IL, 61820      •      (217) 904-9064      •      tengrul2@illinois.edu \n\nTENGRU LI \n\nEDUCATION \nUniversity of Illinois at Urbana-Champaign (UIUC)                                                            Urbana-Champaign, IL \nMaster of Science in Financial Engineering                                                                              August 2017- Present \n \n              Shanghai, China \nEast China University of Science and Technology (ECUST)               \nBachelor of Science in Finance                                                                                         September 2013- June 2017 \nl  Academics: GPA 3.71/4.0 in Advanced Mathematics, Linear Algebra, Statistics, Multivariate Statistics, \n\n \n\n \n\n \n\nProbability, Numerical Analysis, Stochastic Process, C, Econometrics, Macroeconomics, Microeconomics, \nAccounting, Finance, Financial Engineering, Investment Banking \n\nl  Scholarship: 1st Class Integrated Curriculum Scholarship in 2015 and 2nd Class Integrated Curriculum \n\nScholarship in 2014, 2016 &2017. \n\nParticipated in asset allocation simulation and designed multi-asset class portfolios \n\n \nINTERNSHIP EXPERIENCE \nStanley & Partners Investment Management Co., Ltd.                                                                   Shanghai, China \nIntern at Investment Research Department                                                                                                                                                         August 2016- October 2016 \nl  Collected real estate data and assisted in conducting primary data analysis for investment projects \nl  Sought potential cooperation and attended negotiation meetings     \n \nCitibank Young Talent Program                                                                                                                                                                                                                                   Shanghai, China \nTrainee                                                                                                                                                                                                                                                                                                       July 2016- August 2016 \nl \nl  Conducted case analysis on financial market trends and macroeconomic impacts \n \nPing An Tradition International Money Broking Co., Ltd.                                                                                                                                   Shanghai, China \nIntern at Interest Rate Derivatives Department                                                                                                                                               January 2016- March 2016 \nl  Assisted money brokers with quotation and collated deal information   \nl  Gained proficiency in using interest rate swaps and conducted research on bond market trends \n \nCONTESTS \nThe Interdisciplinary Contest in Modeling (ICM), COMAP \n \nHonorable Mention, “Are we heading towards a thirsty planet?”   \nl  Completed data collection   \nl  Applied Factor Analysis on water resources carrying capacity   \nl  Analyzed specific impact of key factors affecting water scarcity \n \nChina Undergraduate Mathematical Contest in Modeling (MUMCM), CSIAM                                                       September 2015 \n3rd Prize Winner of the Shanghai Site, “Taxi Resource Configuration on Internet Plus Era”     \nl  Applied AHP to determine the index of taxi resource supply/demand matching       \nl  Used stochastic birth-death process to analyze taxi full/empty load impacts \n \nSKILLS \nLanguage: Native speaker of Mandarin, fluent in English     \nTechnical: C, MATLAB, EViews, SPSS, MS Word, Excel, PowerPoint \n \nVOLUNTEER ACTIVITIES \nShanghai “Helping the Disabled” Volunteer Team                                                                                                                                                                 Shanghai, China \nl  Delivered lessons for a disabled high-school student                                                                                                                           March 2016- June 2016 \n \nShanghai Fengxian Bus Station Volunteer Activity                                                                         Shanghai, China \nl  Kept orders and provided assistance for passengers                                                                                                     September 2015- October 2015 \n\n                                                February 2016 \n \n\n                         \n\n\f"}, {"filename": "Yitian_Fu.pdf", "text": "Yitian(Faye) Fu \n\n1615 E Florida Ave #304A, Urbana, IL, 61802. (216)767-6981. yitianf2@illinois.edu \n\nEDUCATION \nUniversity of Illinois at Urbana-Champaign                                                                                                 Champaign, IL \nl  M.S. in Financial Engineering                                                                                                               Aug. 2017-Present \nShanghai University of Finance and Economics                                                                                        Shanghai, China \nl  Bachelor of Management in Business Administration, GPA: 3.66/4.0                                               Sep. 2012-Jun. 2016               \nl  Related Courses: Advanced Mathematics (Calculus), Linear Algebra, Probability, Statistics, Computer Programming \n\n(C++), Dynamic Programming, Econometrics, Ordinary Differential Equations \n\nl  Scholarship:  \n\n2013-2014 2nd class People's Scholarship & National Scholarship for Encouragement (top 5%) \n\nWORK EXPERIENCE \nOrient Capital Co.                                                                                                                                         Shanghai, China  \nAssistant Project Manager, Investment Banking Department                                                                    Dec. 2016-May 2017  \nl  Prepared due diligence reports and performed road shows for Huatian EB(Exchangeable bond) funds;  \nl  Tracked EB funds data from Shanghai Securities Exchange Platform and WIND data base and composed EB market \n\nanalysis report. \n\nShanghai Baocheng Network Techology Co.,                                                                                            Shanghai, China \nActuarial Data Analyst                                                                                                                             May 2016-Sep. 2016 \nl  Obtained relevant data of weather (2345 records) using Python and products’ retention rate from MySQL; calculated \n\nloss ratio, conversion rates of websites and repurchase rate for each products; \n\nl  Priced insurance for traffic jam: \n\nu  Calculated base premium based on different factors by Logistic Regression Model using SAS; \n\nl  Priced consecutive three years’ car insurance:  \n\nu  Calibrated quit rate’s distribution for each year with Gamma distribution; \nu  Connected consecutive three years using Markov chain and transition matrix; \nu  Provided insights for underwriting based on sensitivity analysis; \n\nl  Priced innovative product of guessing the oil price: \n\nu  Calibrated the probability of guessing the right oil price with Normal distribution. \n\n                     \n\nTebon Securities \nAssistant Manager for Business Department                                                                                            Mar. 2015-Jun. 2015 \nl  Conducted cash flow analysis for mortgage payment, bank guarantee and market conditions; \nl  Performed in-depth analyses and finished Due Diligence Reports for various trust and asset management projects. \nDatang Telecom Leadcore Technology                                                                                                       Shanghai, China \nAnalyst for Investment Department                                                                                                            Jul. 2014-Sep. 2014 \nl  Conducted investment return forecasting using ARMA model; \nl  Analyzed and summarized overseas M&A rules, regulations and different policies in each country. \nACADEMIC PROJECTS \nInvestment Irrationality and Equity Financing in Behavioral Finance                                                               May 2015 \nl  Employed real-case data of 30 Shanghai Stock Exchange listed companies from Wind to Logistic Regression Model; \nl  Presented the positive relationship between investment irrationality and equity financing by numerical result. \nConsumer Behavior and Commodity Display                                                                                         May 2014-Mar. 2015 \nl  Team leader; \nl  Summarized and reviewed literature (57 papers in total) in Consumer Behavior Analysis; \nl  Designed questionnaire; Collected raw data through questionnaire distribution; \nl  Performed  data  analysis  using  SPSS;  applied  data  to  linear  regression  model  to  evaluate  the  relationship  between \n\nconsumer behavior and commodity display. \n\nEXTRA-CURRICULAR ACTIVITIES  \nVolunteer English & Mathematics teacher for Fudan Tuoye                                                                  Feb. 2016-Apr. 2016 \nMarketing Director, Wesufe Team                                                                                                          Dec. 2014-Mar. 2015 \nl  Initiated “Save the Cat” charity activities; fundraised 3448.18RMB for cat protection;\t\nl  Created and promoted the Wechat public platform of “WeSufe” via various marketing approaches; enrolled over 1000 \n\nfollowers overnight. \n\nTeam Leader, School Debating Team                                                                                                        Sep. 2013-Jan. 2013 \nSKILLS & PROFESSIONAL PROFILE \nl  Passed SOA exam: P (Probability) & FM (Financial Mathematics), \nl  Candidate of CFA level II; Candidate of FRM level I \nl  SAS Base Programming Certification (97%); SAS Advanced Programming Certification (97%); \nl  Proficient in C++；Familiar with MATLAB, R and Python \nl  Working experience in SQL, SPSS and MS Office: Word, Excel (Macros, Pivot Tables, VBA), Access and \n\nPowerPoint \n\n\f"}, {"filename": "Yufei_Gao.pdf", "text": "Tel：+1 (217) 7215174      Email: yufeigao1995@gmail.com \n\nYufei Gao \n\n                                                                                        Champaign, IL   \n\nEDUCATION                                                                                                                                                 \nUniversity of Illinois at Urbana-Champaign \nCurrent student at Master of Science in Financial Engineering Program                                              08.2017-12.2018 \nBeihang University (BUAA)                                                                                                                        Beijing, China                                                                     \nBachelor of Science: Hua Loo-Keng Mathematics Class (founded by BUAA and CAS)                        09.2013-06.2017             \n·  Major: Mathematics and Applied Mathematics \n·  GPA: 90.0/100 (3.85/4.0, Top 10%); Major GPA:3.89/4.0 \n·  Honors&Awards: \n        Excellency Prize of Hua Loo-Keng Talent Program in Mathematics (2017, Honored by CAS) \n        Excellent Graduate of BUAA (2016, Top 15%) \n\n \n\n“Feng Ru Cup” Student Academic Scientific and Technological Works Competition (2016, Top 30% at BUAA) \nMathematical Contest in Modeling (2015, Meritorious Winner, Top 9%) \nNational Computer Rank Examination (2014, Grade 2, C programming language) \n\nACADEMIC EXPERIENCE                                                                                                                         \nThe Applications of Sparse Polynomial Equations in Natural Sciences                                                06.2015-06.2017 \nProvided an efficient method to solve sparse nonlinear polynomial equation groups in order to apply in natural sciences \n·  Combined graph theory, matrix theory, Tarjan algorithms and Grobner basis theory   \n·  Programmed in this project by using the software “Maple” \n·  Searched for cases of biological system from BioModels Data Base to test its effectiveness   \n·  Graduation thesis: Solving Sparse Polynomial Systems \nA Medicine Delivery System to Eradicate Ebola (Based on 2015 MCM Project)   \n“Feng Ru Cup” Student Academic Scientific and Technological Works Competition \n·  Built a model for features of Ebola based on SEIRS model;   \n·  Based on BP neutral network to predict the effective contacts rate \n·  Used Logistic growth model to describe the speed of manufacturing medicine and analyzed its rationality   \n·  Transferred the delivery system into a NLP problem to find the local optimal solution   \nINTERNSHIP EXPERIENCE                                                                                                                       \nNational Bureau of Statistics                                                                                                                        Suqian, China \nData Analyst Intern, Survey Office at Suqian City, Jiangsu Province                                                      09.2016-10.2016 \n·  Read books to learn several statistical methods, such as Time Series Analysis, Regression Analysis \n·  Assisted to carry out a statistical research of surveying the consumer price index (CPI) at Suqian \n·  Did the collection of commodity prices in markets and audited the survey data and summarized the CPI data   \n·  Learnt to use R and Excel to analyze the data; Wrote the final report \nHuatai Securities Company Limited                                                                                                        Shanghai, China \nQuantitative Analyst Intern, Financial Derivatives Department                                                              07.2016-08.2016 \n·  Read the book  “Quantitative Investment”  written by Peng Ding and many other related SCI literatures;  Knew the \n\n                      02.2015-05.2015 \n\n \n\ncompany’s key businesses;   \n\n·  Joined the project “Optimization and Analysis of the Stock Selection Strategy”; Made the trading strategy according \nto K-line patterns; Designed the quantitative stock selection strategy based on MACD indicator; Hedged the stock \ntrading with futures; Wrote the final report   \n\n·  Used Wind Financial Terminal to collect data; Programmed on MATLAB; Tested strategies with historical data \n·  Carried out the project “Stock Screening Based on Analysis of Industry Rankings” on my own \nLEADERSHIP&ACTIVITIES                                                                                                                                       \nGenius Plan (Main Sponsor: JD Capital)                                                                                                    Beijing, China  \nSuperintendent at BUAA                                                                                                                            08.2015-09.2015 \n·  Propagated a new investment pattern in talents (college students) and planed activities in Beihang University \n·  Joined the summit meeting with delegates in other universities; learnt knowledge of financial investment \nBeihang University Model United Nations Association                                                                              Beijing, China \nSelected Member                                                                                                                                          07.2013-06.2014 \n·  Joined the Model United Nations Conference at University of International Relations \n·  Led a team to organize the 1st Model United Nations Conference in Changping District \nOther activities: Beihang Mathematical Modeling Club; Beihang Math Tutoring Centre; Beihang Soccer Club \nSKILL&INTERESTS                                                                                                                                                                           \n·  Technical: C/C++, MATLAB, Maple, Python, Excel, R     \n·  Interests: Basketball, Soccer, Tennis, Table Tennis, Badminton, Swimming \n\n     \n\n\f"}, {"filename": "Yutao_Chen.pdf", "text": "            310 E Springfield Ave, Apt1805B·Champaign, IL, 61820·ychen133@illinois.edu \n\nYutao Chen \n\nEDUCATION \n\nUniversity of Illinois                                                                                            Urbana-Champaign, IL \n  Master of Science in Financial Engineering, December 2018 \nUniversity of Illinois                                                                                            Urbana-Champaign, IL \n            GPA:  3.4/4.0\n\nB.S. in Liberal Arts and Science, Statistics / Actuarial Science, May 2015 \n      High Distinction in Statistics  \n\n \n\n \n\n \n\n \n \n\n \n\nWORKING EXPERIENCE \n\nYinsheng Venture Capital Investment Co., Ltd.                                                          Shenzhen, China \n\nConsultant                                                                                            October 2015 – April 2017 \n\n•  Collected customers’ information (including basic information about the companies and \n\ntheir special needs) \n\n•  Kept close contact with customers; made adjustment to their plans and reported the \n\nadjustment. \n\n•  Communicated with new potential customers; provided them suggestions under the \n\nleadership of supervisor \n\nPing An Life Insurance Company of China, Ltd    \n\n \n\n \n\n \n\nIntern at Development Department of Life Insurance Product     \n\n                          Shenzhen, China \nJuly 2014 – August 2014 \n\n•  Checked the daily guarantee slips \n•  Collected, calculated and modified the account basic information of the users \n•  Collected and summarized the information of the life insurance products \n \n\nSKILLS \n\nLanguage: Native speaker of Chinese, Fluent in English \nTechnical: Microsoft Office, VBA, R, SAS                                                                                       \n\n \n\nACTIVITIES \n\nMember, Actuarial Club, University of Illinois \n\n                            August 2011 – May 2015 \n•  Attended the lectures; joined the club actuarial activities and paid visits to some insurance companies \n•  Discussed with other members and found news solutions to the actuarial problems \n\n \n\n \n\n \n\nVolunteer, Mirror Foundation, International Volunteer HQ \n\n \n\n   \n\n         \n\n \n\n \n\n         July 2013   \n\n•  Proceeded with the rice terracing work; concreted and built a road with other volunteers \n•  Developed the teamwork spirit and interpersonal skills with people from different cultures \n\n \nADDITIONAL \n\nCertificates: Passed Exam FM, Exam P, Exam MFE and Exam MLC by Society of Actuaries (SOA) \n \n\n\f"}, {"filename": "Zishan_Cai.pdf", "text": "ZISHAN CAI \n\n1108 Mitchem Drive \u009f Urbana, IL 61801 \u009f (217) 898-8024 \u009f zcai10@illinois.edu \n\nEducation \nUniversity of Illinois at Urbana-Champaign \nBachelor of Science in Mathematics – Actuarial Science, May 2017 \n\n• James Scholar \n\n \nGPA: 3.65 / 4.00 \nFall 2014 \n\nRelevant Coursework – Linear Algebra, Actuarial Modeling, Probability Theory, Financial Markets, Applied Statistics                                                           \nMaster of Science in Financial Engineering \nUniversity of East Anglia \n• Study Abroad Program \nWork Experience \nIllini Union Rec Room   \nLead Student, customer service                                                                                   \n\n                                                                                                                      Urbana, IL \nJanuary 2015 – May 2017 \n\nExpected Graduation: December 2018 \nNorwich, United Kingdom \nJuly 2015 – August 2015 \n\n• Trained 17 student workers and supervised colleagues to work and communicate effectively with the team \n• Advised manager operational suggestions with personal travelling experience to other recreational centers \n• Interviewed potential candidates for available job positions and aided in assessments \n• Analyzed annual financial reports and purchase orders to bring up operational suggestions \n• Handled customer complaints and maintained great customer service \n\nDapro Corporation, Shanghai branch   \nIntern   \n\nShanghai, China \nMay 2014 – August 2014 \n\n• Wrote proposals and evaluations on new products to be introduced into the company \n• Tested and diagnosed the precision and consistency of 160 flow meters before final shipment as quality control \n• Initiated the use of excel spreadsheets for shipments to increase productivity \n• Communicated with factory workers daily to ensure products’ timely completion \n\nOnly English Learning Center \nTeaching Assistant   \n\nShanghai, China \nJuly 2011 – August 2013 \n\n• Assisted learning center management and arranged course timetables \n• Tutored 80 students aged 12 to 16 on written and oral English learning, customized study plan for each individual \n• Innovated to create an enjoyable studying atmosphere by integrating learning English and watching TV episodes. \nLeadership and Activities \nIllini Billiards Club, University of Illinois \nPresident   \n\nUrbana, IL \nMay 2015 – May 2017 \n\n• Acted as liaison between the club and the pool hall, created beneficial programs for both parties \n• Increased the club members by 150% with successful promotions via social media and campus publication \n\nTreasurer   \n\n• Oversaw financial administration of the club and improved financial situation by effectively fundraising \n• Organized monthly campus tournaments and conducted weekly leagues with 64 players \n\nCivic Leadership Institute, Johns Hopkins Center for Talented Youth \nStudent leader   \n\nMay 2014 – May 2015 \n\nBerkeley, CA \nJuly 2012 – August 2012 \n\n• Led a five-person team to daily jobs at food banks, homeless shelters and soup kitchens to support the homeless society \n• Brainstormed social issues and collaborated ideas with classmates to pursue positive social changes. \nSkills \nLanguages: Mandarin (Native) \nComputer: Microsoft Office, Visual Basic, LaTeX, Adobe Photoshop, MatLab, R \nActuarial Exam Certificates: Probability \n\n\f"}]